Revit 2024 API
FluidType.AddTemperature Method
 Adds a fluid temperature to the set.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public void AddTemperature(
	FluidTemperature fluidTemperature
)
Visual Basic
Public Sub AddTemperature ( _
	fluidTemperature As FluidTemperature _
)
Visual C++
public:
void AddTemperature(
	FluidTemperature^ fluidTemperature
)
Parameters
fluidTemperature
Type: Autodesk.Revit.DB.Plumbing.FluidTemperature
 The fluid temperature being inserted.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  Thrown if the temperature that will be added already exists in the fluid type.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FluidType Class
Autodesk.Revit.DB.Plumbing Namespace